package lt.lhu.unit02.main;

public class Task01 {

	public static void main(String[] args) {
		// Выведите на экран следующий текст.
		System.out.println ("Пройдет много лет, и полковник Аурелиано Буэндиа, стоя у стены в ожидании расстрела, вспомнит");
		System.out.println ("тот далекий вечер, когда отец взял его с собой посмотреть на лед. Макондо было тогда небольшим");
		System.out.println ("селением с двумя десятками хижин, выстроенных из глины и бамбука на берегу реки, которая мчала");
		System.out.println ("свои прозрачные воды ..."); 
		
	}

}
